In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("StudentsPerformance.csv")
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [4]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [5]:
score_cols = ["math score", "reading score", "writing score"]

In [6]:
df["total_score"] = df[score_cols].sum(axis=1)
df["average_score"] = df[score_cols].mean(axis=1)

In [7]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total_score,average_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333

In [8]:
def grade_assign(avg):
    if avg >= 75:
        return "A"
    elif avg >= 60:
        return "B"
    elif avg >= 50:
        return "C"
    elif avg >= 40:
        return "D"
    else:
        return "F"

In [9]:
df["grade"] = df["average_score"].apply(grade_assign)
df[["average_score", "grade"]].head()

   average_score grade
0      72.666667     B
1      82.333333     A
2      92.666667     A
3      49.333333     D
4      76.333333     A

In [10]:
df["rank"] = df["average_score"].rank(ascending=False, method="min").astype(int)
df.sort_values("rank").head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total_score,average_score,grade,rank
458,female,group E,bachelor's degree,standard,none,100,100,100,300,100.000000,A,1
962,female,group E,associate's degree,standard,none,100,100,100,300,100.000000,A,1
916,male,group E,bachelor's degree,standard,completed,100,100,100,300,100.000000,A,1
114,female,group E,bachelor's degree,standard,completed,99,100,100,299,99.666667,A,4
179,female,group D,some high school,standard,completed,97,100,100,297,99.000000,A,5

In [11]:
df["grade"].value_counts()

grade
B    391
A    324
C    182
D     73
F     30
Name: count, dtype: int64

In [12]:
df[score_cols].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

df.sort_values("rank").head(10)

## Grade Distribution

In [13]:
df["grade"].value_counts()

grade
B    391
A    324
C    182
D     73
F     30
Name: count, dtype: int64

## Average score by gender

In [14]:
df.groupby("gender")[["math score", "reading score", "writing score"]].mean()

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

## Average score by test Preparation

In [15]:
df.groupby("test preparation course")[["math score", "reading score", "writing score"]].mean()

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

## Average score by test Lunch

In [16]:
df.groupby("lunch")[["math score", "reading score", "writing score"]].mean()

              math score  reading score  writing score
lunch
free/reduced   58.921127      64.653521      63.022535
standard       70.034109      71.654264      70.823256

## Top 10 Students

Top performing students sorted by specified columns

In [17]:
df.sort_values('rank').head(10)[["gender", "lunch", "test preparation course", "average_score", "grade"]]

     gender         lunch test preparation course  average_score grade
458  female      standard                    none     100.000000     A
962  female      standard                    none     100.000000     A
916    male      standard               completed     100.000000     A
114  female      standard               completed      99.666667     A
179  female      standard               completed      99.000000     A
712  female      standard                    none      99.000000     A
625    male      standard               completed      98.666667     A
165  female      standard               completed      98.666667     A
149    male  free/reduced               completed      97.666667     A
903  female  free/reduced               completed      97.666667     A

## Bottom 10 Students

Bottom 10 students sorted by specified columns

In [18]:
df.sort_values('rank').tail(10)[["gender", "lunch", "test preparation course", "average_score", "grade"]]

     gender         lunch test preparation course  average_score grade
211    male  free/reduced                    none      30.000000     F
787  female      standard                    none      29.666667     F
338  female  free/reduced                    none      29.666667     F
601  female      standard                    none      29.333333     F
76     male      standard                    none      26.000000     F
17   female  free/reduced                    none      26.000000     F
327    male  free/reduced                    none      23.333333     F
596    male  free/reduced                    none      23.000000     F
980  female  free/reduced                    none      18.333333     F
59   female  free/reduced                    none       9.000000     F

## Overall Summary stats

In [19]:
df[["math score", "reading score", "writing score"]].describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000